#pragma once

//----------------------------------------------------------------------------------------------------------
//	Создать программу, которая считывает целое число типа int.
//	И поставить «защиту от дурака» : если пользователь вводит что - то кроме одного целочисленного значения, 
//	нужно вывести сообщение об ошибке и предложить ввести число еще раз.
//	Пример неправильных введенных строк :
//	rbtrb
//	nj34njkn
//	1n
//----------------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------------------------------------
//	Создать собственный манипулятор endll для стандартного потока вывода, который выводит два перевода строки и сбрасывает буфер.
//-------------------------------------------------------------------------------------------------------------------------------




void Lesson_6() {
	cout << "Lesson_6" << endl;
	cout << "----------------" << endl;
}